{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задача 1. Доска\n",
    "Используя новые знания с циклами и оператором end, выведете на экран “доску”, которую вы делали в первом модуле\n",
    "----------\n",
    "|00000000|\n",
    "|00000000|\n",
    "|00000000|\n",
    "|00000000|\n",
    "----------"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "----------\n",
      "|00000000|\n",
      "|00000000|\n",
      "|00000000|\n",
      "|00000000|\n",
      "----------\n"
     ]
    }
   ],
   "source": [
    "tire = '-'\n",
    "ziro = '0'\n",
    "pai = '|'\n",
    "for i in range(2):\n",
    "    if i == 0:\n",
    "        print('----------\\n|00000000|\\n|00000000|')\n",
    "    elif i == 1:\n",
    "        print('|00000000|\\n|00000000|\\n----------')\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задача 2. Локальная сеть\n",
    "У Никиты дома есть много компьютеров, которые он хочет подключить к одной локальной сети. Для этого ему нужно сгенерировать айпи адрес для каждого компьютера. Айпи адрес записывается как 4 числа, которые отделяются точкой. Не долго думая, для генерации Никита решил использовать арифметическую прогрессию, причём первые 3 числа в адресе - это члены прогрессии, а последнее число - это её сумма.\n",
    "\n",
    "Напишите программу, где пользователь вводит первый член прогрессии и разность и в результате получает айпи-адрес.\n",
    "\n",
    " "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите число: 10\n",
      "Введите разность: 1\n",
      "11.12.13.33\n"
     ]
    }
   ],
   "source": [
    "summ = 0\n",
    "number = int(input('Введите число: '))\n",
    "r_number = int(input('Введите разность: '))\n",
    "for i in range(3):\n",
    "    summ += number\n",
    "    number += r_number\n",
    "    \n",
    "    print(number, end='.')\n",
    "print(summ)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задача 3. Табло\n",
    "Петя пишет компьютерную спортивную игру, где каждый “гол” это десять очков. Он хочет сделать красивое табло с градацией этих очков.\n",
    "\n",
    "Пользователь вводит число N (N >= 0). Реализуйте программу, которая выводит в одну строчку каждое десятое число, разделяя их символами “-=-”. Эти же символы стоят перед первым числом и после последнего.\n",
    "\n",
    "Пример:\n",
    "\n",
    "Введите число: 50\n",
    "\n",
    "-=- 0 -=- 10 -=- 20 -=- 30 -=- 40 -=- 50 -=-\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите число: 73\n",
      " -=- 0 -=- 10 -=- 20 -=- 30 -=- 40 -=- 50 -=- 60 -=- 70 -=-\n"
     ]
    }
   ],
   "source": [
    "number = int(input('Введите число: '))\n",
    "for i in range(number//10 + 1):\n",
    "    j = str(i * 10)\n",
    "    print(' -=- ', end=j)\n",
    "print(' -=-')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
