{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задача 1. Урок литературы\n",
    "Выполните задание, разобранное в уроке.\n",
    "\n",
    "К уроку литературы нужно было прочитать “Евгения Онегина”. Учитель задаёт вопрос пяти случайным детям. Она задаёт вопрос “Кто написал произведение?” и если ученик не угадывает, то учитель ставит двойку и спрашивает следующего. Если хоть кто-то угадает, то вопросы больше не задаются. Напишите программу, которая посчитает количество двоечников из этих пяти."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Кто написал войну и мир? - п\n",
      "Неправильно садись два. \n",
      "Кто написал войну и мир? - пушкин\n",
      "Неправильно садись два. \n",
      "Кто написал войну и мир? - толстой\n",
      "Молодец пять! \n",
      "Всего двоечников -  2\n"
     ]
    }
   ],
   "source": [
    "\n",
    "to_student = 0\n",
    "while True:\n",
    "    book = input('Кто написал войну и мир? - ')\n",
    "    if book == 'Толстой' or book == 'толстой':\n",
    "        print('Молодец пять! ')\n",
    "        break\n",
    "    print('Неправильно садись два. ')\n",
    "    to_student += 1\n",
    "print('Всего двоечников - ', to_student)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задача 2. Начальник\n",
    "Напишите программу для робота-начальника. Он спрашивает у пользователя, выполнил ли он задание, которые выдавал вчера, и продолжает это делать до тех пор, пока тот не ответит ему “Да, конечно, сделал”."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Ты выполнил задание которое я тебе задал? да\n",
      "Ты выполнил задание которое я тебе задал? Да\n",
      "Молодец.\n"
     ]
    }
   ],
   "source": [
    "while True:\n",
    "    question = input('Ты выполнил задание которое я тебе задал? ')\n",
    "    if question == 'Да':\n",
    "        print('Молодец.')\n",
    "        break\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задача 3. Дразнилка.\n",
    "Напишите программу-дразнилку “Купи слона”. Она спрашивает у пользователя, как его зовут, затем отвечает “%username%, купи слона”. Дальше, что бы он ни говорил, она передразнивает: Все говорят “...”, а ты купи слона!\n",
    "\n",
    "Пример:\n",
    "\n",
    "Как тебя зовут? Дима\n",
    "\n",
    "Дима, купи слона!\n",
    "\n",
    "Хорошо, давай куплю\n",
    "\n",
    "Все говорят Хорошо, давай куплю, а ты купи слона!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Как тебя зовут? антон\n",
      "антон Купи слона.нет\n",
      "Все говорят нет а ты \n",
      "антон Купи слона.возможно\n",
      "Все говорят возможно а ты \n"
     ]
    }
   ],
   "source": [
    "name = input('Как тебя зовут? ')\n",
    "while True:\n",
    "    question = input('{} Купи слона.'. format(name))\n",
    "    \n",
    "    \n",
    "    print('Все говорят {} а ты '. format(question))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
